[
  {
    "imageSrc": "/assets/images/Clips.png",
    "altText": "Clips",
    "title": "Clips",
    "description": "A dynamic Angular web app for seamless video uploading, organization, and playback. Clips features robust forms, real-time video management, responsive design, efficient state management, and Firebase integration, delivering a smooth and user-friendly experience across devices."
  },
  {
    "imageSrc": "/assets/images/Vidly.png",
    "altText": "Vidly",
    "title": "Vidly",
    "description": "A React-based movie rental application showcasing CRUD operations, state management, and routing. Vidly features dynamic UI updates, reusable components, and backend integration to manage movie listings and rentals effectively. Built with a focus on clean design and scalable architecture."
  },
  {
    "imageSrc": "/assets/images/Beatmaker.png",
    "altText": "Beatmaker",
    "title": "Beatmaker",
    "description": "An interactive JavaScript-based beat-maker weapp featuring customizable sounds like kick, snare, and hi-hat. Includes functionality to adjust tempo and speed, toggling sound playback and providing a dynamic and engaging music creation experience."
  },
  {
    "imageSrc": "/assets/images/Photon.png",
    "altText": "Photon",
    "title": "Photon",
    "description": "Photon is a JavaScript image viewer using Pixels API. It features infinite scrolling, a modern UI, optimized performance, and a download option for effortless browsing and saving of stunning images."
  },
  {
    "imageSrc": "/assets/images/Snake.png",
    "altText": "Snake",
    "title": "Snake Game",
    "description": "A classic Snake Game built with Java Swing and AWT, featuring all the traditional gameplay mechanics. This project is compatible across all operating systems, delivering a nostalgic and seamless gaming experience."
  },
  {
    "imageSrc": "/assets/images/ToDoList.png",
    "altText": "ToDoList",
    "title": "To Do List",
    "description": "A JavaScript-based to-do list application with features to add, delete, filter, and mark tasks as done, offering a simple yet effective task management solution. The app focuses on user-friendly interactions and seamless functionality."
  }
]
